using Tyuiu.BerezovskayaGO.Sprint1.Task2.V6.Lib;
DataService ds = new DataService();

Console.Title = "Спринт #1 | Выполнила: Березовская Г. О. | АСОиУБ - 24-1";
Console.WriteLine("********************************************************************************************");
Console.WriteLine("* Спринт #1                                                                                *");
Console.WriteLine("* Тема: Арифметические операторы в C#                                                      *");
Console.WriteLine("* Задание #2                                                                               *");
Console.WriteLine("* Вариант #6                                                                               *");
Console.WriteLine("* Выполнила: Березовская Галина Олеговна | АСОиУБ - 24-1                                   *");
Console.WriteLine("********************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                 *");
Console.WriteLine("* Написать программу, которая запришивает у пользователя исходные данные,                  *");
Console.WriteLine("* выполняет указанные расчёты и печатает результат на экране.                              *");
Console.WriteLine("*                                                                                          *");
Console.WriteLine("********************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                         *");
Console.WriteLine("********************************************************************************************");

int x;

Console.WriteLine("Введите расстояние в метрах: ");
x = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("********************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                               *");
Console.WriteLine("********************************************************************************************");

Console.WriteLine("Расстояние в киллометрах: " + ds.ConvertMToKm(x));

Console.ReadLine();
